src/Sources/SRP/PeselTestData/PESEL_JACEK_KORPUSIK_Request 1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pes="http://msw.gov.pl/srp/v3_0/uslugi/pesel/">
<soapenv:Header/>
<soapenv:Body>
<pes:wyszukajPodstawoweDaneOsoby>
<requestId>bde65ac3-8eaa-4d93-8217-cda1342fb730</requestId>
<kryteriaWyszukiwania>
<kryteriumImienia>
<imiePierwsze>JACEK</imiePierwsze>
<innyZapis>false</innyZapis>
<zakres>DANE_AKTUALNE</zakres>
</kryteriumImienia>
<kryteriumNazwiska>
<nazwisko>KORPUSIK</nazwisko>
<dowolneNazwisko>false</dowolneNazwisko>
<innyZapis>true</innyZapis>
<zakres>DANE_AKTUALNE</zakres>
</kryteriumNazwiska>
</kryteriaWyszukiwania>
</pes:wyszukajPodstawoweDaneOsoby>
</soapenv:Body>
</soapenv:Envelope>